'''1) З бібліотеки flask імпортуємо клас Flask'''
from flask import Flask

'''2) У випадку імпорту __name__ - буде ім’ям поточного файлу'''
app = Flask(__name__)

'''6) Використовуємо декоратор route(), щоб сказати Flask, який URL запустить функцію
   7) def index() - повертає повідомлення, яке буде відображено в браузері за URL адресою "/" та "index"
'''

@app.route("/index")
@app.route("/")
def index():
    return "index"


@app.route("/about")
def about():
    return "<h1>Про сайт</h1>"


'''3) У випадку самостійного запуску __name__ - буде мати значення __main__;
      if __name__ == '__main__' - є умовою, що локальний сервер запуститься тільки
      при безпосередньому запуску з Python,  а не при імпортуванні як модуль 
'''
if __name__ == "__main__":
    '''4) Для запуску локального сервера використовуємо функцію run()'''
    '''5) debug=True - щоб ми в браузері бачили всі помилки, які виникатимуть під час розробки сайту'''
    app.run(debug=True)
